In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import requests as req
from bs4 import BeautifulSoup as bs
from selenium import webdriver as wb
from selenium.webdriver.common.keys import Keys
import time 
h = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36"}
import os 
from urllib.request import urlretrieve

## 인공지능반 데이터프레임 만들기

In [7]:
dic= pd.Series([6,7,4,3,20], index= ['빅데이터분석가', '자영업','웹개발자','대학원', '합계'])

In [8]:
dic

빅데이터분석가     6
자영업         7
웹개발자        4
대학원         3
합계         20
dtype: int64

In [9]:
dic.name = '인공지능반'

In [12]:
dic.index.name ='진로희망'

In [14]:
pd.DataFrame(dic)

         인공지능반
진로희망
빅데이터분석가      6
자영업          7
웹개발자         4
대학원          3
합계          20

In [15]:
dic= {"진로희망":["빅데이터분석가", "자영업", "웹개발자", "대학원", "합계"]
        ,"도수":[6,7,4,3,20]}

In [18]:
pd.DataFrame(dic)

      진로희망  도수
0  빅데이터분석가   6
1      자영업   7
2     웹개발자   4
3      대학원   3
4       합계  20

In [20]:
# 리스트로 만들기
df_list = pd.DataFrame([['빅데이터분석가',6], 
                        ['자영업',7], 
                        ['웹개발자', 4], 
                        ['대학원',3], 
                        ['합계',20]], columns = ['진로희망', '도수']
                      )

In [30]:
df_list.name = "인공지능반"

## 빅데이터반 데이터프레임 만들기

In [22]:
b_dic = {"진로희망":["빅데이터분석가", "자영업", "웹개발자", "대학원", "합계"]
        ,"도수":[12,14,10,14,50]}

In [26]:
b_dic=pd.DataFrame(b_dic)

In [27]:
b_dic.name = "빅데이터반"

In [29]:
b_dic

      진로희망  도수
0  빅데이터분석가  12
1      자영업  14
2     웹개발자  10
3      대학원  14
4       합계  50

In [ ]:
df_list

      진로희망  도수     진로희망  도수
0  빅데이터분석가   6  빅데이터분석가  12
1      자영업   7      자영업  14
2     웹개발자   4     웹개발자  10
3      대학원   3      대학원  14
4       합계  20       합계  50

In [33]:
i_dic= {"진로희망":["빅데이터분석가", "자영업", "웹개발자", "대학원", "합계"]
        ,"도수":[6,7,4,3,20]}
b_dic = {"진로희망":["빅데이터분석가", "자영업", "웹개발자", "대학원", "합계"]
        ,"도수":[12,14,10,14,50]}

In [38]:
i_df=pd.DataFrame(i_dic)

In [39]:
b_df=pd.DataFrame(b_dic)

In [63]:
i_df

      진로희망  도수
0  빅데이터분석가   6
1      자영업   7
2     웹개발자   4
3      대학원   3
4       합계  20

In [64]:
b_df

      진로희망  도수
0  빅데이터분석가  12
1      자영업  14
2     웹개발자  10
3      대학원  14
4       합계  50

## 인공지능반, 빅데이터반 데이터프레임 합치기

In [51]:
# concat
df_concat=pd.concat([i_df,b_df['도수']],axis=1)

In [52]:
df_concat

      진로희망  도수  도수
0  빅데이터분석가   6  12
1      자영업   7  14
2     웹개발자   4  10
3      대학원   3  14
4       합계  20  50

In [54]:
df_concat.columns=['진로희망','인공지능반','빅데이터반']

In [55]:
df_concat

      진로희망  인공지능반  빅데이터반
0  빅데이터분석가      6     12
1      자영업      7     14
2     웹개발자      4     10
3      대학원      3     14
4       합계     20     50

In [57]:
df_concat.set_index('진로희망', inplace = True)

In [58]:
df_concat

         인공지능반  빅데이터반
진로희망
빅데이터분석가      6     12
자영업          7     14
웹개발자         4     10
대학원          3     14
합계          20     50

In [66]:
#merge
df_merge = pd.merge(i_df, b_df, on = "진로희망")

In [69]:
df_merge.columns = ["진로희망", "인공지능반", "빅데이터반"]

In [70]:
df_merge

      진로희망  인공지능반  빅데이터반
0  빅데이터분석가      6     12
1      자영업      7     14
2     웹개발자      4     10
3      대학원      3     14
4       합계     20     50